/* 
2.1 Переменные let

let - это ключевое слово для объявления переменной
a - это переменная
= это оператор присваивания
45 знаение
*/

let a =45;

/*
2.2 Числа
*/

let digit = 25; //этот пример и все ниже - это лиеральная запись числа (присвоиваем указанной переменной выбранное число)
let fract = 25.03;
let exp = 2e10; //2*10^10= 20000000000
let expSmall = 2e-3;//0.0021
let expFract = 1.25e3; //1250
let expFractSmall = 1.25e-3; //0.00125
let fract1 = 25.; //25
let fract2 = .25; //0.25
let digit1 = -25 //для любойвышеуказанной переменной можно поставить минус передзначением, тогда значение будет отрицательным

//десятичная система счисления: 1, 2, 3, 4, 5, 6, 7, 8, 9
//двоичная система счисления: 0, 1, 10, 11, 100, 101, 110, 111 и т д

let dec = 9; //запись цифры 9 в десятичной системе счисления
let bin = 0b1001; //запись цифры 9 в двоичной системе счисления
let b = dec === bin; //должно быть true



