/*1.1 Интро
Цель:
- изучить javaScript
- писать браузерные приложения
- освоить принципы программирования
- разработка в команде 

описание:
"Мы рады приветствовать вас на курсе «JavaScript».

Мы — команда Skillbox, и хотим с вами познакомиться перед тем, как вы начнете обучение и приблизитесь к мечте. 
Пожалуйста, заполните анкету, чтобы мы больше о вас узнали."

ссылка на анкету: https://forms.gle/BhZFgAA8VexwifDD6
*/

/*
1.2 О курсе
рссказал на кого ориентирован курс
упомянул Git
рассказал чему научимся
сказал как сдать домашние задания

1) на кого ориентирован курс?
ответ: на начинающих разработчиков без опыта в программировании

желательно иметь базовое представление что такое html и css

2) что будет в курсе?
ответ:
- синтаксис и экосистема языка
- подходы к организации кода
- сферы применения
- пользовательские интерфейсы
- автоматизация тестирования
- soft skills
- практика 
*/

/*
1.3 JavaScript и области применения
JavaScript - интерпретируемый язык общего назначения

Теория:
компилятор - переводит текстовый файл с кодом в язык понятный машинам
интерпретатор - сразу запускает код
JavaScript - это интерпретируемый язык
основная область применения JavaScript - это веб разработка
на JavaScript можно писать изоморфные приложения (приложения, которые одинаково себя ведут на веб и мобильной версии)
*/

/*
1.4 Инструменты разработчика
вводный рассказ про VScode, Git, Node.js
пример работы с консолью разработчика в браузере 
*/

/*
1.5 Первый проект
что такое проект? то что объединяет в себевсе необходимое для работы проекта (папки и файлы)
запуск скрипта через файл JS
запустил код через консоль браузера 
*/


