/*
Тип данных - это информация о том как хранить данные. Как мы помним, компьютер хранит данные в виде 0 и 1

но сами по себе 0 и 1 - бесполезные т.к. компьютер не знает как их интерпретировать.
Зато если мы скажем компьютеру какой тип информации хранится в указанном наборе 0 и 1, 
то мы сможем передать таким данным определенный смысл.

Важно отметить, что тип данных не только определяет значение для набора 0 и 1. 
Он еще указывает на то, какие оперции можно производить с этим значением.
Например с числами мы можем производиь математические операции, а строики можем соединять друг с другом 
*/